#include<iostream>
#include<time.h>
using namespace std;
int main()
{
	cout<<"                                 猜拳游戏"<<endl; 

	cout<<"                 |-------用户------电脑------结果------|"<<endl;
	cout<<"                 |-------剪刀      石头      电脑胜    |"<<endl; 
	cout<<"\n"<<endl;
	cout<<"                              【游戏规则】"<<endl;
	cout<<"          1.游戏分5局，每局你可以猜拳一次，分胜，负，平三种结果"<<endl;;
	cout<<"          2.游戏中你可以输入1，2，3代表石头，剪刀，布"<<endl;
	cout<<"          3.石头比剪刀大，剪刀比布大，布比石头大"<<endl;
	cout<<"          4.5局结束后你可以选择再来一次或直接退出游戏"<<endl;
	cout<<"\n";
	cout<<"                              【游戏选项】"<<endl;
	cout<<"                                 1.石头"<<endl;
	cout<<"                                 2.剪刀"<<endl;
	cout<<"                                 3.布"<<endl;
	int user;//用户 
	int NPC;//电脑
	int u=0,n=0;//两者分数                                                                                                                                  
	int num=1;//游戏局数 

			do
			{
							cout<<"用户出拳:"<<endl;
							cin>>user; 
				if(user!=1&&user!=2&&user!=3)
					{
						cout<<"你的出拳出错，请按规则出拳"<<endl; 
						continue;
					} 
					   srand((unsigned)time(NULL));
					    NPC=rand()%3+1;
					    cout<<"电脑出拳："<<'\n'<<NPC<<endl; 
					if(user==1)
					{
						switch(NPC)
							{
								case 1:
									cout<<"这一局你出的是【石头】，电脑出的是【石头】,这局是平局"<<endl; 
									break;
								case 2:
									cout<<"这一局你出的是【石头】，电脑出的是【剪刀】，这局您赢了"<<endl; 
									u++;
									break;
								case 3:
									cout<<"这一局你出的是【石头】，电脑出的是【布】，这局你输了"<<endl; 
									n++;
									break;
							}
							 
					}
					else if(user==2)
					{
							switch(NPC)
								{
									case 1:
										cout<<"这一局你出的是【剪刀】，电脑出的是【石头】，这局你输了"<<endl; 
										n++;
										break;
									case 2:
										cout<<"这一局你出的是【剪刀】，电脑出的是【剪刀】,这局是平局"<<endl; 
										break;
									case 3:
										cout<<"这一局你出的是【剪刀】，电脑出的是【布】，这局您赢了"<<endl; 
										u++;
										break;
								}
								 
						}
						else if(user==3)
							{
									switch(NPC)
										{
											case 1:
												cout<<"这一局你出的是【布】，电脑出的是【石头】，这局你赢了"<<endl; 
												u++;
												break;
											case 2:
												cout<<"这一局你出的是【布】，电脑出的是【剪刀】,这局你输了"<<endl; 
												u++; 
												break;
											case 3:
												cout<<"这一局你出的是【布】，电脑出的是【布】，这局是平局"<<endl; 
												break;
										}
										 
								}
								num++;
			}while(num<=5); 
		

	//判断结果			
			if(n>u)
			{
				cout<<"-----------------------------------------------------------------------------"<<endl;
				cout<<"电脑赢了"<<n<<"局"<<",你赢了"<<u<<"局"<<",平局"<<5-n-u<<"局"<<'\n'<<"很遗憾，您输给了电脑！"<<endl;
				cout<<"-----------------------------------------------------------------------------"<<endl;
			}
			if(n<u)
			{
			    cout<<"-----------------------------------------------------------------------------"<<endl;
			    cout<<"电脑赢了"<<n<<"局"<<",你赢了"<<u<<"局"<<",平局"<<5-n-u<<"局"<<'\n'<<"恭喜，您赢了！"<<endl;
		    	cout<<"-----------------------------------------------------------------------------"<<endl;
			}
			if(n==u)
			{
		    	cout<<"-----------------------------------------------------------------------------"<<endl;
		    	cout<<"电脑赢了"<<n<<"局"<<",你赢了"<<u<<"局"<<",平局"<<5-n-u<<"局"<<'\n'<<"最后的结果是平局"<<endl;
		    	cout<<"-----------------------------------------------------------------------------"<<endl;
			}
			

	 
	return 0;
}
